marmbrus/circuits/roomsensor/src/sdkconfig.defaults
# This config is ignored
# Run idf.py set-target esp32s2
# CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_PARTITION_TABLE_CUSTOM=y

# Enable SPI-RAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

# USE SPI-RAM for TLS
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y